@no-close-browser
Feature: Управление объявлением

Scenario: Пользователь управляет своим объявлением
  Given пользователь зарегистрирован через API
  And пользователь успешно авторизован

  When пользователь открывает главную страницу
  And переходит в форму создания объявления
  And заполняет форму объявления валидными данными
  And публикует объявление
  Then объявление успешно опубликовано

  When пользователь открывает страницу редактирования объявления
  And изменяет данные объявления
  And сохраняет изменения
  Then изменения успешно применены

  When пользователь удаляет объявление
  Then объявление успешно удалено