@no-close-browser
Feature: Управление объявлениями

  Scenario: Успешное создание объявления
    Given пользователь зарегистрирован через API
    And пользователь успешно авторизован
    When пользователь открывает главную страницу
    And переходит в форму создания объявления
    And заполняет форму объявления валидными данными
    And публикует объявление
    Then объявление успешно опубликовано

  Scenario: Успешное редактирование своего объявления
    Given пользователь зарегистрирован через API
    And пользователь успешно авторизован
    When пользователь открывает главную страницу
    And переходит в форму создания объявления
    And заполняет форму объявления валидными данными
    And публикует объявление
    And объявление успешно опубликовано
    And пользователь открывает страницу редактирования объявления
    And изменяет данные объявления
    And сохраняет изменения
    Then изменения успешно применены

  Scenario: Успешное удаление своего объявления
    Given пользователь зарегистрирован через API
    And пользователь успешно авторизован
    And переходит в форму создания объявления
    And заполняет форму объявления валидными данными
    And публикует объявление
    And объявление успешно опубликовано
    And у пользователя есть опубликованное объявление
    When пользователь удаляет объявление
    Then объявление успешно удалено

