Feature: Регистрация пользователя

  Scenario: Успешная регистрация с уникальным email
    Given пользователь открывает главную страницу
    When нажимает кнопку "Вход и регистрация"
    And переходит на форму регистрации
    And заполняет форму регистрации новыми уникальными данными
    Then пользователь успешно зарегистрирован

  Scenario: Попытка повторной регистрации с тем же email
    Given пользователь с уникальным email и паролем создан через API
    When пользователь открывает главную страницу
    And нажимает кнопку "Вход и регистрация"
    And переходит на форму регистрации
    And заполняет форму регистрации
    Then отображается ошибка о существующем пользователе